<?php

namespace App;

use Illuminate\Database\Eloquent\Model;

class Quiz extends Model
{
    static $questions = [
        '1' => 'Интересует ли Вас процесс установления соединения между абонентами?',
        '2' => 'Интересует ли Вас от чего зависит дальность распространения радиоволн?',
        '3' => 'Интересует ли Вас как работает мобильная связь GSM, LTE, 5G?',
        '4' => 'Интересует ли Вас процесс преобразования речи в электрический сигнал?',
        '5' => 'Интересует ли Вас передача речи и информации на дальние расстояния?',
        '6' => 'Интересует ли Вас как работают навигационные системы и определяется местоположение?',
        '7' => 'Интересует ли Вас конфигурация антенн и почему они различные?',
        '8' => 'Интересует ли Вас принцип передачи цифрового телевизионного сигнала?',
        '9' => 'Интересует ли Вас передача звука и изображение?',
        '10' => 'Нравились ли вам в детстве кубики, конструкторы и Лего?',
        '11' => 'Вы чувствуете себя уверенно при решении логических задач?',
        '12' => 'Вам легко удается запоминать разнообразные последовательности действий?',
        '13' => 'У вас есть распорядок дня?',
        '14' => 'Вам нравится наводить порядок?',
        '15' => 'Вы считаете себя организованным человеком?',
        '16' => 'Хотели бы вы научиться управлять компьютером?',
        '17' => 'Вы знаете сколько бит в байте?',
        '18' => 'Вы видите упорядоченность в природе?',
        '19' => 'Вам нравится управлять машинами?',
        '20' => 'Вам интересен вопрос защиты информации?',
        '21' => 'Желаете ли вы выступать на турнирах по кибербезопасности?',
        '22' => 'Интересны ли вам устройста прослушки?',
        '23' => 'Интересны ли вам способы защиты от прослушки и несанкционированного доступа?',
        '24' => 'Интересна ли вам математика?',
        '25' => 'Хотели бы вы разбираться в устройстве вирусов?',
        '26' => 'Хотели вы бы моделировать и совершать информационные атаки?',
        '27' => 'Интересуют ли вас криптографические методы защиты информации?',
        '28' => 'Интересен ли вас принцип работы антивируса на компьютере?',
        '29' => 'Получить востребованную специальность, которая позволит Вам иметь постоянную высокооплачиваемую работу на железнодорожном транспорте.',
        '30' => 'Пройти обучение на курсах повышения квалификации и по окончании университета попасть в кадровый резерв начальника Западно-Сибирской железной дороги.',
        '31' => 'Получить во время учебы дополнительно рабочую профессию по обслуживанию устройств железнодорожной автоматики.',
        '32' => 'Выполнять дипломные проекты по заданию (грантам) Западно-Сибирской железной дороги, ОАО «РЖД» (стоимость гранта – до 30 тысяч рублей).',
        '33' => 'Научиться управлять движением поездов.',
        '34' => 'Получить навыки разработки, проектирования и обслуживания устройств автоматики, обеспечивающих высокую пропускную способность железных дорог и безопасность движения на железнодорожном транспорте.',


    ];
    static $probabilities = [
        [1 => [0.15, 0.0001], 2 => [0.2, 0.0001], 4 => [0.15, 0.0001], 6 => [0.2, 0.0001], 8 => [0.2, 0.0001], 9 => [0.2, 0.001], 10 => [0.2, 0.02], 11 => [0.2, 0.0001], 12 => [0.2, 0.0001], 15 => [0.2, 0.0001], 16 => [0.2,0], 17 => [0.2, 0.01], 19 => [0.2, 0.0001], 20 => [0.001, 0.15], 21 => [0.1, 0.2], 22 => [0.0001, 0.2], 23 => [0.0001, 0.2], 25 => [0.001, 0.2], 26 => [0.001, 0.2], 27 => [0.001, 0.2], 28 => [0.001, 0.2], 29 => [0.001, 0.2], 30 => [0.001, 0.2], 31=> [0.001, 0.2], 32 => [0.001, 0.2], 33 => [0.001, 0.2], 34 => [0.001, 0.2]],
        [1 => [0.0001, 0.2], 2 => [0.001, 0.2], 3 => [0.001, 0.2], 4 => [0.1, 0.2], 5 => [0.001, 0.2], 6 => [0.001, 0.2], 7 => [0.001, 0.2], 8 => [0.001, 0.2], 9 => [0.2, 0.001], 10 => [0.3, 0.001], 11 => [0.3, 0.02], 12 => [0.2, 0.001], 14 => [0.2, 0.001], 16 => [0.2, 0], 17 => [0.2, 0.01], 18 => [0.2, 0.01], 19 => [0.2, 0.0001], 20 => [0.001, 0.15], 21 => [0.1, 0.2], 22 => [0.0001, 0.2], 23 => [0.0001, 0.2], 25 => [0.001, 0.2], 26 => [0.001, 0.2], 27 => [0.001, 0.2], 28 => [0.001, 0.2], 29 => [0.001, 0.2], 30 => [0.001, 0.2], 31=> [0.001, 0.2], 32 => [0.001, 0.2], 33 => [0.001, 0.2], 34 => [0.001, 0.2]],
        [1 => [0.25, 0.0001], 2 => [0.2, 0.0001], 3 => [0.25, 0.001], 4 => [0.2, 0.001], 5 => [0.2, 0.001], 6 => [0.25, 0.001], 7 => [0.2, 0.001], 8 => [0.2, 0.0001], 9 => [0.2, 0.001], 10 => [0.15, 0.001], 11 => [0.1, 0.001], 12 => [0.1, 0.001], 16 => [0.15, 0.001], 17 => [0.05, 0.15], 20 => [0.1, 0.05], 21 => [0.1, 0.05], 22 => [0.2, 0.001], 23 => [0.2, 0.0001], 25 => [0.001, 0.13], 26 => [0.001, 0.13], 27 => [0.001, 0.13], 28 => [0.001, 0.13], 29 => [0.001, 0.2], 30 => [0.001, 0.2], 31=> [0.001, 0.2], 32 => [0.001, 0.2], 33 => [0.001, 0.2], 34 => [0.001, 0.2]],
        [1 => [0.01, 0.15], 2 => [0.01, 0.13], 3 => [0.01, 0.13], 4 => [0.15, 0.01], 5 => [0.2, 0.001], 6 => [0.2, 0.001], 7 => [0.2, 0.001], 8 => [0.15, 0.001], 9 => [0.2, 0.001], 10 => [0.15, 0.001], 11 => [0.13, 0.001], 12 => [0.1, 0.001], 14 => [0.2, 0.001], 15 => [0.1, 0.001], 16 => [0.1, 0], 19 => [0.15, 0.0001], 20 => [0.001, 0.13], 21 => [0.001, 0.13], 22 => [0.001, 0.13], 23 => [0.001, 0.13], 24 => [0.13, 0.001], 25 => [0.001, 0.13], 26 => [0.001, 0.13], 27 => [0.13, 0.001], 28 => [0.001, 0.13], 29 => [0.001, 0.2], 30 => [0.001, 0.2], 31=> [0.001, 0.2], 32 => [0.001, 0.2], 33 => [0.001, 0.2], 34 => [0.001, 0.2]],
        [1 => [0.15, 0.001], 2 => [0.13, 0.001], 3 => [0.15, 0.001],4 => [0.01, 0.12],5 => [0.2, 0.001], 6 => [0.01,0.1], 7 => [0.15, 0.001],8 => [0.2, 0.001],9 => [0.15, 0.001],10 => [0.12, 0.001],11 => [0.1, 0.001], 15 => [0.12, 0.001],16 => [0.2, 0],17=> [0.12, 0.01],18 => [0.1, 0.01],19 => [0.1, 0.001],20 => [0.3, 0.001],21 => [0.3, 0.001],22 => [0.3, 0.001],23 => [0.3, 0.001],24 => [0.2, 0.001],25 => [0.2, 0.001],26 => [0.3, 0.001],27 => [0.25, 0.001],28 => [0.1, 0.001], 29 => [0.001, 0.2], 30 => [0.001, 0.2], 31=> [0.001, 0.2], 32 => [0.001, 0.2], 33 => [0.001, 0.2], 34 => [0.001, 0.2]],
        [1 => [0.01, 0.2], 2 => [0.001, 0.12], 3 => [0.001, 0.1],4 => [0.001, 0.12],5 => [0.01, 0.15],6 => [0.001, 0.1],7=> [0.001, 0.16],8 => [0.001, 0.11],9 => [0.001, 0.11],10 => [0.1, 0.001],11 => [0.12, 0.001],12 => [0.15, 0.001],16 => [0.2, 0],17=> [0.15, 0.001], 19 => [0.2, 0.001],20 => [0.3, 0.001],21 => [0.3, 0.001],22 => [0.15, 0.001],23 => [0.2, 0.001],24 => [0.15, 0.001],25 => [0.3, 0.001],26 => [0.3, 0.001],27 => [0.2, 0.0001],28 => [0.3, 0.0001], 29 => [0.001, 0.2], 30 => [0.001, 0.2], 31=> [0.001, 0.2], 32 => [0.001, 0.2], 33 => [0.001, 0.2], 34 => [0.001, 0.2]],
        [1 => [0.05, 0.1], 2 => [0.001, 0.12], 3 => [0.001, 0.011],4 => [0.001, 0.12],5 => [0.001, 0.12],6 => [0.2, 0.001],7=> [0.001, 0.12],8 => [0.0001, 0.11],9 => [0.002, 0.1],11 => [0.2, 0.001],16 => [0.2, 0],17=> [0.2, 0.02],19 => [0.2, 0.001],20 => [0.3, 0.001],21 => [0.3, 0.001],22 => [0.25, 0.001],23 => [0.3, 0.0001],24 => [0.3, 0.0001],25 => [0.2, 0.001],26 => [0.25, 0.001],27 => [0.3, 0.001],28 => [0.2, 0.001], 29 => [0.001, 0.2], 30 => [0.001, 0.2], 31=> [0.001, 0.2], 32 => [0.001, 0.2], 33 => [0.001, 0.2], 34 => [0.001, 0.2]],
        [1 => [0.01, 0.1], 2 => [0.2, 0.001], 3 => [0.001, 0.1],4 => [0.001, 0.01],5 => [0.001, 0.1],6 => [0.001, 0.1],7=> [0.001, 0.1],8 => [0.001, 0.1],9 => [0.2, 0.001],10 => [0.2, 0.001],11 => [0.15, 0.001],12 => [0.2, 0.001],13 => [0.15, 0.001],14 => [0.5, 0.001], 15 => [0.2, 0.001],16 => [0.001, 0.15],17=> [0.001, 0.1],18 => [0.15, 0.001],19 => [0.2, 0.001],20 => [0.001, 0.1],21 => [0.001, 0.1],22 => [0.001, 0.1],23 => [0.001, 0.1],24 => [0.001, 0.1],25 => [0.001, 0.1],26 => [0.001, 0.1],27 => [0.001, 0.1],28 => [0.001, 0.1], 29 => [0.2, 0.001], 30 => [0.2,0.001], 31=> [0.2,0.001], 32 => [0.2,0.001], 33 => [0.2,0.001], 34 => [0.2,0.001]],
        [1 => [0.1, 0.001], 2 => [0.1, 0.01], 3 => [0.001, 0.1],4 => [0.1, 0.001],5 => [0.2, 0.001],6 => [0.15, 0.001],7=> [0.001, 0.1],8 => [0.15, 0.001],9 => [0.001, 0.1],10 => [0.1, 0.001],11 => [0.1, 0.001],12 => [0.001, 0.1],13 => [0.001, 0.1],14 => [0.1, 0.001], 15 => [0.1, 0.001],16 => [0, 0.2],17=> [0.001, 0.1],18 => [0.0001, 0.1],19 => [0.1, 0.001],20 => [0.0001, 0.1],21 => [0.0001, 0.1],22 => [0.0001, 0.1],23 => [0.0001, 0.1],24 => [0.0001, 0.1],25 => [0.0001, 0.1],26 => [0.0001, 0.1],27 => [0.0001, 0.1],28 => [0.0001, 0.1], 29 => [0.2, 0.001], 30 => [0.2,0.001], 31=> [0.2,0.001], 32 => [0.2,0.001], 33 => [0.2,0.001], 34 => [0.2,0.001]],
        [1 => [0.2, 0.001], 2 => [0.2, 0.001], 3 => [0.2, 0.001],4 => [0.14, 0.001],5 => [0.15, 0.001],6 => [0.001, 0.1],7=> [0.1, 0.001],8 => [0.15, 0.001],9 => [0.1, 0.001],10 => [0.12, 0.001],11 => [0.1, 0.001],12 => [0.1, 0.001],13 => [0.0001, 0.1],14 => [0.2, 0.001], 15 => [0.1, 0.001],16 => [0, 0.001],17=> [0.001, 0.12],20 => [0.0001, 0.1],21 => [0.0001, 0.1],22 => [0.0001, 0.1],23 => [0.0001, 0.1],24 => [0.0001, 0.1],25 => [0.0001, 0.1],26 => [0.0001, 0.1],27 => [0.0001, 0.1],28 => [0.0001, 0.1], 29 => [0.2, 0.001], 30 => [0.2,0.001], 31=> [0.2,0.001], 32 => [0.2,0.001], 33 => [0.2,0.001], 34 => [0.2,0.001]],
    ];
    static $answers = [0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1];
    static $results = [
        'Бакалавриат 09.03.01 Информатика и вычислительная техника, направленность (профиль) «Информатика и программная инженерия»',
        'Бакалавриат 09.03.02 Информационные системы и технологии, направленность (профиль) «Программирование и информационные технологии»',
        'Бакалавриат 11.03.02 Инфокоммуникационные технологии и системы связи, направленность (профиль) «Системы мобильной связи»',
        'Бакалавриат 27.03.04 Управление в технических системах, направленность (профиль) «Информационно-управляющие системы»',
        'Специатитет 10.05.02 Информационная безопасность телекоммуникационных систем, специализация «Информационная безопасность мультисервисных телекоммуникационных сетей и систем на транспорте»',
        'Специатитет 10.05.03 Информационная безопасность автоматизированных систем, специализация «Информационная безопасность автоматизированных систем на транспорте»',
        'Специатитет 10.05.04 Информационно-аналитические системы безопасности, специализация «Технологии информационно-аналитического мониторинга»',
        'Специатитет 23.05.05 Системы обеспечения движения поездов, специализация «Автоматика и телемеханика на железнодорожном транспорте»',
        'Специатитет 23.05.05 Системы обеспечения движения поездов, специализация «Радиотехнические системы на железнодорожном транспорте»',
        'Специатитет 23.05.05 Системы обеспечения движения поездов, специализация «Телекоммуникационные системы и сети железнодорожного транспорта»',
    ];

    static function jsonQuestions()
    {
        return self::$questions;
    }
}
